In [1]:
# Please change the myid as your UserID assigned
#
myid='1'
%load_ext sql
mypass = "mysql+mysqlconnector://admin:xxx@1.1.1.1/airportdb".replace("{myid}", myid)
%sql  $mypass

In [2]:
myoutput = %sql select 1;
display(myoutput)
myoutput = %sql show databases;
display(myoutput)

 * mysql+mysqlconnector://admin:***@1.1.1.1/airportdb
1 rows affected.

[(1,)]

 * mysql+mysqlconnector://admin:***@1.1.1.1/airportdb
26 rows affected.

[('LogAnalytics',),
 ('ML_SCHEMA_admin',),
 ('airflight',),
 ('airportdb',),
 ('center3',),
 ('custref',),
 ('employees',),
 ('healthcheck',),
 ('helloworld',),
 ('information_schema',),
 ('ml_data',),
 ('mydb',),
 ('mydb2',),
 ('mydemo',),
 ('mysql',),
 ('mysql_audit',),
 ('mysql_option',),
 ('mysql_rest_service_metadata',),
 ('mysql_tasks',),
 ('mytest',),
 ('najm',),
 ('performance_schema',),
 ('quickstart',),
 ('sys',),
 ('world',),
 ('xm',)]

In [3]:
%%sql
show create table weatherdata;

 * mysql+mysqlconnector://admin:***@1.1.1.1/airportdb
1 rows affected.

[('weatherdata', "CREATE TABLE `weatherdata` (\n  `log_date` date NOT NULL,\n  `time` time NOT NULL,\n  `station` int NOT NULL,\n  `temp` decimal(3,1) NOT NULL,\n  `hu ... (502 characters truncated) ... Pröll, Eva Zangerle, Wolfgang Gassler is licensed under CC BY 4.0. To view a copy of this license, visit https://creativecommons.org/licenses/by/4.0'")]

In [9]:
%%time
# %sql ALTER TABLE weatherdata secondary_load;
%sql select @mytime := sysdate(6);  
%time myoutput = %sql select /*+ SET_VAR(use_secondary_engine=ON) */ "ON" status, log_date, count(*) from weatherdata where log_date > DATE '2005-01-01' group by log_date order by log_date;
display(myoutput.DataFrame().tail(10))
myoutput = %sql select timediff(sysdate(6), @mytime);
display(myoutput)
%sql select @mytime := sysdate(6);
%time myoutput = %sql select /*+ SET_VAR(use_secondary_engine=OFF) */"OFF" status, log_date, count(*) from weatherdata where log_date > DATE '2005-01-01' group by log_date order by log_date;
display(myoutput.DataFrame().tail(10))
myoutput = %sql select timediff(sysdate(6), @mytime);
display(myoutput)

 * mysql+mysqlconnector://admin:***@1.1.1.1/airportdb
1 rows affected.
 * mysql+mysqlconnector://admin:***@1.1.1.1/airportdb
4015 rows affected.
CPU times: user 39.6 ms, sys: 3.02 ms, total: 42.6 ms
Wall time: 798 ms

     status    log_date  count(*)
4005     ON  2015-12-21      1152
4006     ON  2015-12-22      1152
4007     ON  2015-12-23      1152
4008     ON  2015-12-24      1152
4009     ON  2015-12-25      1152
4010     ON  2015-12-26      1152
4011     ON  2015-12-27      1152
4012     ON  2015-12-28      1152
4013     ON  2015-12-29      1152
4014     ON  2015-12-30      1152

 * mysql+mysqlconnector://admin:***@1.1.1.1/airportdb
1 rows affected.

[(datetime.timedelta(microseconds=838121),)]

 * mysql+mysqlconnector://admin:***@1.1.1.1/airportdb
1 rows affected.
 * mysql+mysqlconnector://admin:***@1.1.1.1/airportdb
4015 rows affected.
CPU times: user 81.3 ms, sys: 3.37 ms, total: 84.7 ms
Wall time: 891 ms

     status    log_date  count(*)
4005    OFF  2015-12-21      1152
4006    OFF  2015-12-22      1152
4007    OFF  2015-12-23      1152
4008    OFF  2015-12-24      1152
4009    OFF  2015-12-25      1152
4010    OFF  2015-12-26      1152
4011    OFF  2015-12-27      1152
4012    OFF  2015-12-28      1152
4013    OFF  2015-12-29      1152
4014    OFF  2015-12-30      1152

 * mysql+mysqlconnector://admin:***@1.1.1.1/airportdb
1 rows affected.

[(datetime.timedelta(microseconds=932168),)]

CPU times: user 149 ms, sys: 12.6 ms, total: 162 ms
Wall time: 1.84 s

In [10]:
%%sql
explain select count(*) from weatherdata where log_date > DATE '2005-01-01'group by log_date order by log_date;

 * mysql+mysqlconnector://admin:***@1.1.1.1/airportdb
1 rows affected.

[("-> Group aggregate: count(0)  (cost=283..1.14e+6 rows=4017)\n    -> Covering index range scan on weatherdata using PRIMARY over ('2005-01-01' < log_date)  (cost=0.35..810177 rows=2.31e+6)\n",)]

In [11]:

%%sql
set autocommit=true;
EXPLAIN SELECT
airline.airlinename,
AVG(datediff(departure,birthdate)/365.25) as avg_age,
count(*) as nb_people
FROM
    booking, flight, airline, passengerdetails
WHERE
    booking.flight_id=flight.flight_id AND
    airline.airline_id=flight.airline_id AND
    booking.passenger_id=passengerdetails.passenger_id AND
    country IN ("SWITZERLAND", "FRANCE", "ITALY")
GROUP BY
    airline.airlinename
ORDER BY
    airline.airlinename, avg_age
LIMIT 10;

 * mysql+mysqlconnector://admin:***@1.1.1.1/airportdb
0 rows affected.
1 rows affected.

[("-> Sort: airline.airlinename, limit input to 10 row(s) per chunk  (cost=85.5e+6..85.5e+6 rows=10)\n    -> Table scan on <temporary>  (cost=85.5e+6..8 ... (859 characters truncated) ... cost=0.516..238083 rows=461286)\n                        -> Hash\n                            -> Table scan on airline  (cost=0.636..71.9 rows=113)\n",)]

In [7]:

%%sql
set autocommit=false;
EXPLAIN SELECT
airline.airlinename,
AVG(datediff(departure,birthdate)/365.25) as avg_age,
count(*) as nb_people
FROM
    booking, flight, airline, passengerdetails
WHERE
    booking.flight_id=flight.flight_id AND
    airline.airline_id=flight.airline_id AND
    booking.passenger_id=passengerdetails.passenger_id AND
    country IN ("SWITZERLAND", "FRANCE", "ITALY")
GROUP BY
    airline.airlinename
ORDER BY
    airline.airlinename, avg_age
LIMIT 10;

 * mysql+mysqlconnector://myuser1:***@10.0.1.29/airportdb
0 rows affected.
4 rows affected.

[(1, 'SIMPLE', 'passengerdetails', None, 'ALL', 'PRIMARY', None, None, None, 36271, 30.0, 'Using where; Using temporary; Using filesort'),
 (1, 'SIMPLE', 'booking', None, 'ref', 'seatplan_unq,flight_idx,passenger_idx', 'passenger_idx', '4', 'airportdb.passengerdetails.passenger_id', 682, 100.0, None),
 (1, 'SIMPLE', 'flight', None, 'eq_ref', 'PRIMARY,airline_idx', 'PRIMARY', '4', 'airportdb.booking.flight_id', 1, 100.0, None),
 (1, 'SIMPLE', 'airline', None, 'eq_ref', 'PRIMARY', 'PRIMARY', '2', 'airportdb.flight.airline_id', 1, 100.0, None)]

   mysql+mysqlconnector://admin:***@10.0.1.47/airportdb
 * mysql+mysqlconnector://myuser1:***@10.0.1.47/airportdb
   mysql+mysqlconnector://myuser2:***@10.0.1.47/airportdb
1 rows affected.

[('autocommit', 'OFF')]

In [12]:
%%time
%%sql
set autocommit=true;
SELECT /*+ SET_VAR(use_secondary_engine=FORCED) */
airline.airlinename,
AVG(datediff(departure,birthdate)/365.25) as avg_age,
count(*) as nb_people
FROM
    booking, flight, airline, passengerdetails
WHERE
    booking.flight_id=flight.flight_id AND
    airline.airline_id=flight.airline_id AND
    booking.passenger_id=passengerdetails.passenger_id AND
    country IN ("SWITZERLAND", "FRANCE", "ITALY")
GROUP BY
    airline.airlinename
ORDER BY
    airline.airlinename, avg_age
LIMIT 10;

 * mysql+mysqlconnector://admin:***@1.1.1.1/airportdb
0 rows affected.
(mysql.connector.errors.DatabaseError) 3889 (HY000): Secondary engine operation failed. Reason: "You have not defined the secondary engine for at least one of the query tables [airportdb.booking].".
[SQL: SELECT /*+ SET_VAR(use_secondary_engine=FORCED) */
airline.airlinename,
AVG(datediff(departure,birthdate)/365.25) as avg_age,
count(*) as nb_people
FROM
    booking, flight, airline, passengerdetails
WHERE
    booking.flight_id=flight.flight_id AND
    airline.airline_id=flight.airline_id AND
    booking.passenger_id=passengerdetails.passenger_id AND
    country IN ("SWITZERLAND", "FRANCE", "ITALY")
GROUP BY
    airline.airlinename
ORDER BY
    airline.airlinename, avg_age
LIMIT 10;]
(Background on this error at: https://sqlalche.me/e/20/4xp6)
CPU times: user 7.12 ms, sys: 3.09 ms, total: 10.2 ms
Wall time: 59 ms

In [9]:
%%time
%%sql
set autocommit=true;
SELECT /*+ SET_VAR(use_secondary_engine=OFF) */
airline.airlinename,
AVG(datediff(departure,birthdate)/365.25) as avg_age,
count(*) as nb_people
FROM
    booking, flight, airline, passengerdetails
WHERE
    booking.flight_id=flight.flight_id AND
    airline.airline_id=flight.airline_id AND
    booking.passenger_id=passengerdetails.passenger_id AND
    country IN ("SWITZERLAND", "FRANCE", "ITALY")
GROUP BY
    airline.airlinename
ORDER BY
    airline.airlinename, avg_age
LIMIT 10;

 * mysql+mysqlconnector://myuser1:***@10.0.1.29/airportdb
0 rows affected.
10 rows affected.
CPU times: user 4.61 ms, sys: 1.21 ms, total: 5.81 ms
Wall time: 14 s

[('Afghanistan Airlines', Decimal('45.92612137'), 20570),
 ('Albania Airlines', Decimal('46.02485633'), 21804),
 ('American Samoa Airli', Decimal('46.10098466'), 15249),
 ('Angola Airlines', Decimal('45.97214161'), 18539),
 ('Argentina Airlines', Decimal('46.03115082'), 21298),
 ('Australia Airlines', Decimal('46.07925759'), 19986),
 ('Azerbaijan Airlines', Decimal('46.01659919'), 16011),
 ('Bahamas Airlines', Decimal('46.22542566'), 22564),
 ('Belarus Airlines', Decimal('46.10818585'), 18226),
 ('Bhutan Airlines', Decimal('46.13252703'), 22873)]